pmo-dataset/mermaid/20.mmd
graph LR
	classDef endEvent stroke-width:4px
	
	ParallelGateway_3{"+"} --> Task_9["Manager submits\norder ticket to\nkitchen"]
	ExclusiveGateway_2{"X"} --> ExclusiveGateway_1{"X"}
	Task_4["Manager takes down\nthe order"] --> ParallelGateway_3
	Task_13["Guest calls room\nservice"] --> Task_4
	ExclusiveGateway_2 --> Task_6["Waiter waits/delays\ndebiting"]
	ParallelGateway_3 --> Task_12["Manager assigns\norder to waiter"]
	Task_12 --> ParallelGateway_2{"+"}
	ParallelGateway_3 --> ExclusiveGateway_3{"X"}
	ParallelGateway_2 --> Task_5["Waiter prepares\nnonalcoholic drinks"]
	Task_8["Waiter debits\nguest's account"] --> EndNoneEvent_1(("end")):::endEvent
	Task_10["Waiter returns to\nroom-service station"] --> ExclusiveGateway_2
	Task_5 --> ParallelGateway_1{"+"}
	ParallelGateway_2 --> Task_1["Waiter readies cart"]
	ExclusiveGateway_1 --> Task_8
	ExclusiveGateway_4{"X"} --> ParallelGateway_1
	Task_2["Kitchen prepares\nfood"] --> ParallelGateway_1
	ExclusiveGateway_3 --> Task_7["Manager gives order\nto sommelier"]
	StartNoneEvent_1(("start")) --> Task_13
	Task_11["Waiter delivers\norder to guest's\nroom"] --> Task_10
	Task_9 --> Task_2
	ParallelGateway_1 --> Task_11
	Task_3["Sommelier fetches\nwine and prepare\nalcoholic beverages"] --> ExclusiveGateway_4
	Task_7 --> Task_3
	Task_6 --> ExclusiveGateway_1
	Task_1 --> ParallelGateway_1
	ExclusiveGateway_3 --> ExclusiveGateway_4
